
&НаКлиенте
Процедура Фильтр(Команда)
	//// Вставить содержимое обработчика.
	//Список.отбор.код.ВидСравнения = ВидСравнения.Равно;
	//Список.отбор.код.Значение = "127";
	//Список.отбор.код.Использование = Истина;
	
	Список.Отбор.Элементы.Очистить();
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номер");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    ЭлементОтбора.ПравоеЗначение = "000000005";
 КонецПроцедуры

&НаКлиенте
 Процедура Все(Команда)
	 Список.Отбор.Элементы.Очистить();

 КонецПроцедуры

&НаКлиенте
 Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	 //Вставить содержимое обработчика
 КонецПроцедуры
