
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		//Вставить содержимое обработчика
	//Сообщить("Основная конфигурация", СтатусСообщения.Внимание);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		//Сообщить("Основная конфигурация После записи", СтатусСообщения.Внимание);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВеличинаОклада(Команда)
	// Вставить содержимое обработчика.
	 ОткрытьФорму("Отчет.ОтчетПоКонтрагентам.Форма");
	 
КонецПроцедуры

&НаКлиенте
Процедура ГиперКоманда(Команда)
	 ОткрытьФорму("Отчет.ОтчетПоКонтрагентам.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ШкалаПриИзменении(Элемент)
	
	Объект.ЧислоШкалы = Шкала;
	
КонецПроцедуры
