
&НаСервере
Процедура ТестНаСервере()
	// Вставить содержимое обработчика.
//ОткрытьФорму("Документ.РеализацияТоваровИУслуг.ФормаСписка");	
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	//ТестНаСервере();
	//ОткрытьФорму("Документ.РеализацияТоваровИУслуг.ФормаСписка");	
	
	Оповестить("ТестНажали","Вот Так Вот!");
КонецПроцедуры
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПарамаетрыФО = Новый Структура ("Контрагент", Объект.Поставщик);
	УстановитьПараметрыФункциональныхОпцийФормы(   ПарамаетрыФО) ;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	ПарамаетрыФО = Новый Структура ("Контрагент", Объект.Клиент);
	УстановитьПараметрыФункциональныхОпцийФормы(   ПарамаетрыФО) ;

КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
		// Вставить содержимое обработчика.
	ПарамаетрыФО = Новый Структура ("Контрагент", Объект.Поставщик);
	УстановитьПараметрыФункциональныхОпцийФормы(   ПарамаетрыФО) ;

КонецПроцедуры
