
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПарамаетрыФО = Новый Структура ("Контрагент", Объект.Клиент);
	УстановитьПараметрыФункциональныхОпцийФормы(   ПарамаетрыФО) ;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	ПарамаетрыФО = Новый Структура ("Контрагент", Объект.Клиент);
	УстановитьПараметрыФункциональныхОпцийФормы(   ПарамаетрыФО) ;

КонецПроцедуры

&НаКлиенте
Процедура ТестСервера(Команда)
	// Вставить содержимое обработчика.
	ОбщийМодульСерверный.ТестСервераСерверныйМодуль();
	//ТестСервераСерверныйМодуль();

КонецПроцедуры
